#include <stdio.h>
#include <math.h>

int main() {

    double x, y;
    printf("Введите координаты x y");
    scanf("%lf %lf", &x, &y);

    if((x<=2 && y>=-4) && (0 <=x && 0 >= y)){
        printf("+ Точка в закрашенной области");
    }
    
    else if((x*x + y*y<=16)&&(x >=-4 && y<=4) && (0 >=x && 0 <= y)){
        printf("+ Точка в закрашенной области");
    }

    else if((x <= 2 && y <= 4) && (0 <=x && 0 <= y) && (y = (-2*x+4))){
        printf("+Точка в закрашенной области");
    }

    else if ((x>= -4 && y >= -4)&&(x<=0 && y<=0)&&(y = (x-4))){
        printf("+ Точка в закрашенной области");
    }
    
    else {
        printf("- Точка не в закрашенной области");
    }


    return 0;

}